[
  {
    "title": "Har Ki Dun",
    "description": "Har Ki Dun is a mesmerizing valley situated in the Garhwal Himalayas. The trek takes you through dense pine forests, quaint villages, and offers breathtaking views of snow-capped peaks. The base camp in Sankri serves as a gateway to this enchanting trek.",
    "location": "Uttarakhand - Sankri",
    "imgSrc": "https://example.com/harkidun.jpg"
  },
  {
    "title": "Roopkund",
    "description": "Roopkund is a high-altitude glacial lake nestled in the Uttarakhand Himalayas. The trek is known for its mysterious skeletal remains and stunning alpine meadows. Lohajung, the base camp, is the starting point for this adventurous journey.",
    "location": "Uttarakhand - Lohajung",
    "imgSrc": "https://example.com/roopkund.jpg"
  },
  {
    "title": "Triund",
    "description": "Triund is a popular trekking destination in the Dhauladhar range of Himachal Pradesh. The trail offers panoramic views of the Kangra Valley and the snow-covered Dhauladhar range. McLeod Ganj, the base camp, adds a touch of Tibetan culture to the trekking experience.",
    "location": "Himachal Pradesh - McLeod Ganj",
    "imgSrc": "https://example.com/triund.jpg"
  },
  {
    "title": "Kedarkantha",
    "description": "Kedarkantha is a winter trek that unveils the beauty of snow-covered landscapes in the Garhwal region. Sankri, the base camp, serves as the starting point for this snowy adventure. The trek provides breathtaking views of the Swargarohini and Black Peak.",
    "location": "Uttarakhand - Sankri",
    "imgSrc": "https://example.com/kedarkantha.jpg"
  },
  {
    "title": "Hampta Pass",
    "description": "Hampta Pass is a trek that takes you from the lush green Kullu Valley to the desert-like Spiti Valley. The journey is marked by river crossings, lush meadows, and panoramic vistas. The trek starts from Manali, the gateway to the beautiful Himachal Pradesh.",
    "location": "Himachal Pradesh - Manali",
    "imgSrc": "https://example.com/hamptapass.jpg"
  },
  {
    "title": "Valley of Flowers",
    "description": "Valley of Flowers is a vibrant and colorful national park in Uttarakhand. The trek unveils a floral paradise with a variety of alpine flowers. The base camp in Govindghat is the starting point for this enchanting journey into nature's beauty.",
    "location": "Uttarakhand - Govindghat",
    "imgSrc": "https://example.com/valleyofflowers.jpg"
  },
  {
    "title": "Beas Kund",
    "description": "Beas Kund is a high-altitude alpine lake surrounded by majestic peaks. The trek, starting from Manali in Himachal Pradesh, offers stunning views of the surrounding mountains, including the magnificent Friendship Peak.",
    "location": "Himachal Pradesh - Manali",
    "imgSrc": "https://example.com/beaskund.jpg"
  },
  {
    "title": "Test Title",
    "description": "Test Desc",
    "location": "Test location",
    "imgSrc": "Test URL"
  }
 
]